Revit 2027 API
FamilyInstance.flipHand Method
The orientation of family instance hand will be flipped. If it can not be flipped, return false, otherwise return true.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool flipHand()
Public Function flipHand As Boolean
public:
bool flipHand()
member flipHand : unit -> bool
Return Value
Boolean
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace